Tekla Open API Reference for Tekla Structures 2025
SurfaceObject.CreateHoles Property
 Gets or sets a value indicating whether CreateHoles parameter of the surface object.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool CreateHoles { get; set; }
Public Property CreateHoles As Boolean
	Get
	Set
Property Value
Type: Boolean
true if [create holes]; otherwise, false.
See Also
Reference
SurfaceObject Class
Tekla.Structures.Model Namespace